app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
     product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(:product_id => product.id)
    #@line_item = LineItem.new( :product_id => @product.id , :cart_id => @cart.id )

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "7"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 24 Sep 2013 11:01:31 UTC +00:00], ["updated_at", Tue, 24 Sep 2013 11:01:31 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 11], ["created_at", Tue, 24 Sep 2013 12:29:11 UTC +00:00], ["product_id", 7], ["quantity", 1], ["updated_at", Tue, 24 Sep 2013 12:29:11 UTC +00:00]]